Autodesk.Revit.DB.VertexIndexPairArray
An array that contains VertexIndex pairs.

Autodesk.Revit.DB.VertexIndexPairArray.Insert(Autodesk.Revit.DB.Geometry.XYZ@,System.Int32)
System.Int32
Insert the specified VertexIndex pair into the array.
item: The VertexIndex pair to be inserted into the array.
index: The VertexIndex pair will be inserted before this index.
Returns: Returns whether theVertexIndex pair was inserted into the array.

Autodesk.Revit.DB.VertexIndexPairArray.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the array.
Returns: Returns a forward moving iterator to the array.

Autodesk.Revit.DB.VertexIndexPairArray.ReverseIterator
Autodesk.Revit.DB.VertexIndexPairArrayIterator
Retrieve a backward moving iterator to the array.
Returns: Returns a backward moving iterator to the array.

Autodesk.Revit.DB.VertexIndexPairArray.ForwardIterator
Autodesk.Revit.DB.VertexIndexPairArrayIterator
Retrieve a forward moving iterator to the array.
Returns: Returns a forward moving iterator to the array.

Autodesk.Revit.DB.VertexIndexPairArray.Append(Autodesk.Revit.DB.Geometry.XYZ@)
void
Add the VertexIndex pair to the end of the array.
item: The VertexIndex pair to be added.

Autodesk.Revit.DB.VertexIndexPairArray.Clear
void
Removes every VertexIndex pair from the array, rendering it empty.

Autodesk.Revit.DB.VertexIndexPairArray.Size
System.Int32
get
Returns the number of VertexIndex pairs that are in the array.

Autodesk.Revit.DB.VertexIndexPairArray.Item(System.Int32)
System.Object
Gets or sets a VertexIndex pair at a specified index within the array.
index: The index of the VertexIndex pair to be set or retrieved.
Returns: Returns the VertexIndex pair at the specified index.

Autodesk.Revit.DB.VertexIndexPairArray.IsEmpty
System.Boolean
get
Test to see if the array is empty.
Remarks: If the array is empty then True will be returned, otherwise False.